In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [19, 21, 22, 18, 20],
    'Score': [85, 70, 92, 78, 88]
}
df = pd.DataFrame(data)

In [3]:
df.head(3)

      Name  Age  Score
0    Alice   19     85
1      Bob   21     70
2  Charlie   22     92

In [4]:
df.describe()

             Age     Score
count   5.000000   5.00000
mean   20.000000  82.60000
std     1.581139   8.70632
min    18.000000  70.00000
25%    19.000000  78.00000
50%    20.000000  85.00000
75%    21.000000  88.00000
max    22.000000  92.00000

In [5]:
df['Score'].mean()

np.float64(82.6)

In [6]:
df[df['Age'] > 20]

      Name  Age  Score
1      Bob   21     70
2  Charlie   22     92

In [7]:
df[df['Score'] > 80]

      Name  Age  Score
0    Alice   19     85
2  Charlie   22     92
4      Eva   20     88